[
  {
    "date": "June 2024",
    "title": "Study Abroad in Bremen, Germany",
    "type": "Mindset Shift",
    "description": "While working toward my Bachelor's degree in Information Systems at UMSL, I applied for a study abroad program in Germany. My time in Germany was transformative, and it solidified my desire to move to Europe. During this time, I also visited the Netherlands for the first time, which sparked my interest in relocating there. I was even able to fly two of my younger sisters to spend a few days with me in the Netherlands, and they loved it too. The program ended and I returned to the U.S. in July 2024, but I knew I wanted to return to Europe permanently. I made the decision to start planning my move to the Netherlands.",
    "links": [
      {
        "text": "My short interview about studying abroad",
        "url": "https://blogs.umsl.edu/news/2024/10/07/international-business-ranked-us-news-world-report/"
      }
    ]
  },
  {
    "date": "July 2024",
    "title": "Downsizing and Preparing for the Move",
    "type": "Logistics",
    "description": "Upon returning from Germany and with a clear vision of my future in the Netherlands, I began the process of downsizing my belongings. I immediately sold my car, which was my way of confirming for myself that I was serious about this move. It was the first step in a series of logistical preparations that included selling or donating furniture, clothes, and other possessions that no longer fit my future. I also transferred to the smallest apartment in my current building, not only slashing $1000 off my monthly rent, but forcing me to live with less \"stuff\". I set the goal to move with one single bag.",
    "links": [
      {
        "text": "My travel backpack: Osprey Farpoint 55",
        "url": "https://www.osprey.com/farpointr-55-travel-pack-2"
      }
    ]
  },
  {
    "date": "July 2024",
    "title": "Researching Visas and Work Options",
    "type": "Logistics",
    "description": "Admittedly, I knew very little about visas at this point. I started researching the various visa options available for moving to the Netherlands. It took about a week of research before I found the Dutch American Friendship Treaty (DAFT) visa. This visa was appealing because it allowed me to start a business in the Netherlands and live there for up to 2 years, with the possibility of extension. The business can be a simple sole proprietorship, which suited my needs as a software developer. I easily met the requirements for the DAFT visa, and the work requirements (entrepreneurship) aligned perfectly with my background. I was already freelancing/contracting and had clients, which would help me meet the income requirements for the visa. At this point, it's just another one of my several moves to a new city (but this time across the Atlantic Ocean).",
    "links": [
      {
        "text": "DAFT visa information",
        "url": "https://www.cardon.nl/blog/the-dutch-daft-visa-for-american-immigrants-in-5-steps"
      },
      {
          "text": "Becoming a ZZP'er in the Netherlands",
          "url": "https://business.gov.nl/starting-your-business/starting-as-a-self-employed-professional/get-started-as-a-freelancer-or-zzper/"
      }
    ]
  },
  {
    "date": "July 2024",
    "title": "Nederlands Leren (Learning Dutch)",
    "type": "Mindset Shift",
    "description": "I don't care how much of the Dutch population speaks English. Learning the local language is a sign of respect and a way to integrate into society. I started learning Dutch in July 2024, using the app Duolingo. It was the easiest and most obvious way to get started. I supplemented my learning with YouTube videos, books, podcasts, ChatGPT and Dutch courses. I also started listening to Dutch music and watching Dutch TV shows with English subtitles to immerse myself in the language. By the end of 2024, I was a strong A2 level in Dutch with B1 so close I could taste it. Ik kan met zekerheid zeggen dat ik een beetje Nederlands spreek. Het is a moeilijke taal maar ik studeer en oefen elke dag. Geen Google Translate.",
    "links": [
      {
        "text": "My Dutch R&B/Vibes playlist on YouTube",
        "url": "https://www.youtube.com/playlist?list=PLfPFQwvfKWcSL5UuFm_YLLOP0RWF5XCAf"
      },
      {
        "text": "Learn Dutch with Kim",
        "url": "https://www.youtube.com/channel/UCWiOWGpwDZbJuSesaxMHkRg"
      },
      {
        "text": "My Duolingo profile",
        "url": "https://www.duolingo.com/profile/seanchdavis"
      }
    ]
  },
  {
    "date": "October 2024",
    "title": "City Shopping in the Netherlands",
    "type": "Logistics",
    "description": "Up to this point, I had been to several cities in in both Germany and the Netherlands (NL). However, in NL, I had only spent a decent amount of time in Amsterdam. I wasn't convinced that was my only option. So, I flew back to NL for the sole purpose of \"city shopping.\" Alongside another one of my sisters I spent several days exploring Rotterdam - a city I knew I would enjoy after plenty of research. I also visited and explored Utrecht. There was no doubt in my mind that Rotterdam was my speed. Plus, considering how small the Netherlands is, I could easily travel anywhere in the country within a few hours by train. I decided Rotterdam was the perfect fit for me. My sister agreed.",
    "links": [
      {
        "text": "Rotterdam Netherlands Walking Tour",
        "url": "https://www.youtube.com/watch?v=rRm94fFdaDY"
      }
    ]
  },
  {
    "date": "November 2024",
    "title": "Savings Target in Euros",
    "type": "Logistics",
    "description": "From the outside looking in, I still live in the U.S. In my mind, the move has already begun. That means I would need to make decisions as though I was in the middle of moving, not as if the move was coming in the future. I set a savings target of €14,500, which is €4,500 for the DAFT visa business account reserve plus an additional €10,000 for securing an apartment paying any fees. I actually set this savings target in October during my visit to Rotterdam. Because I had already sold my car and downsized my living expenses significantly, I was able to save aggressively (pure strategy). I opened a Wise account to hold my Euros. I am already the type to track my finances meticulously using Excel. So, every time money came in, I already knew exactly how much of it to transfer, leaving the rest for my U.S. expenses.",
    "links": [
      {
        "text": "Holding Euros with Wise",
        "url": "https://wise.com/invite/dic/seand823"
      },
      {
          "text": "DAFT visa requirements (see the business account reserve)",
          "url": "https://dutchamericanfriendship.com/how-to-get-a-daft-visa/"
      }
    ]
  }
]
