[
  {
    "date": "June 2024",
    "title": "Study Abroad in Bremen, Germany",
    "type": "Mindset Shift",
    "description": "While working toward my Bachelor's degree in Information Systems at UMSL, I applied for a study abroad program in Germany. My time in Germany was transformative, and it solidified my desire to move to Europe. During this time, I also visited the Netherlands for the first time, which sparked my interest in relocating there. I was even able to fly two of my younger sisters to spend a few days with me in the Netherlands, and they loved it too. The program ended and I returned to the U.S. in July 2024, but I knew I wanted to return to Europe permanently. I made the decision to start planning my move to the Netherlands.",
    "links": [
      {
        "text": "My short interview about studying abroad",
        "url": "https://blogs.umsl.edu/news/2024/10/07/international-business-ranked-us-news-world-report/"
      }
    ]
  },
  {
    "date": "July 2024",
    "title": "Downsizing and Preparing for the Move",
    "type": "Logistics",
    "description": "Upon returning from Germany and with a clear vision of my future in the Netherlands, I began the process of downsizing my belongings. I immediately sold my car, which was my way of confirming for myself that I was serious about this move. It was the first step in a series of logistical preparations that included selling or donating furniture, clothes, and other possessions that no longer fit my future. I also transferred to the smallest apartment in my current building, not only slashing $1000 off my monthly rent, but forcing me to live with less \"stuff\". I set the goal to move with one single bag.",
    "links": [
      {
        "text": "My travel backpack: Osprey Farpoint 55",
        "url": "https://www.osprey.com/farpointr-55-travel-pack-2"
      }
    ]
  },
  {
    "date": "July 2024",
    "title": "Researching Visas and Work Options",
    "type": "Logistics",
    "description": "Admittedly, I knew very little about visas at this point. I started researching the various visa options available for moving to the Netherlands. It took about a week of research before I found the Dutch American Friendship Treaty (DAFT) visa. This visa was appealing because it allowed me to start a business in the Netherlands and live there for up to 2 years, with the possibility of extension. The business can be a simple sole proprietorship, which suited my needs as a software developer. I easily met the requirements for the DAFT visa, and the work requirements (entrepreneurship) aligned perfectly with my background. I was already freelancing/contracting and had clients, which would help me meet the income requirements for the visa. At this point, it's just another one of my several moves to a new city (but this time across the Atlantic Ocean).",
    "links": [
      {
        "text": "DAFT visa information",
        "url": "https://www.cardon.nl/blog/the-dutch-daft-visa-for-american-immigrants-in-5-steps"
      },
      {
          "text": "Becoming a ZZP'er in the Netherlands",
          "url": "https://business.gov.nl/starting-your-business/starting-as-a-self-employed-professional/get-started-as-a-freelancer-or-zzper/"
      }
    ]
  },
  {
    "date": "July 2024",
    "title": "Nederlands Leren (Learning Dutch)",
    "type": "Mindset Shift",
    "description": "I don't care how much of the Dutch population speaks English. Learning the local language is a sign of respect and a way to integrate into society. I started learning Dutch in July 2024, using the app Duolingo. It was the easiest and most obvious way to get started. I supplemented my learning with YouTube videos, books, podcasts, ChatGPT and Dutch courses. I also started listening to Dutch music and watching Dutch TV shows with English subtitles to immerse myself in the language. By the end of 2024, I was a strong A2 level in Dutch with B1 so close I could taste it. Ik kan met zekerheid zeggen dat ik een beetje Nederlands spreek. Het is a moeilijke taal maar ik studeer en oefen elke dag. Geen Google Translate.",
    "links": [
      {
        "text": "My Dutch R&B/Vibes playlist on YouTube",
        "url": "https://www.youtube.com/playlist?list=PLfPFQwvfKWcSL5UuFm_YLLOP0RWF5XCAf"
      },
      {
        "text": "Learn Dutch with Kim",
        "url": "https://www.youtube.com/channel/UCWiOWGpwDZbJuSesaxMHkRg"
      },
      {
        "text": "My Duolingo profile",
        "url": "https://www.duolingo.com/profile/seanchdavis"
      }
    ]
  },
  {
    "date": "October 2024",
    "title": "City Shopping in the Netherlands",
    "type": "Logistics",
    "description": "Up to this point, I had been to several cities in in both Germany and the Netherlands (NL). However, in NL, I had only spent a decent amount of time in Amsterdam. I wasn't convinced that was my only option. So, I flew back to NL for the sole purpose of \"city shopping.\" Alongside another one of my sisters I spent several days exploring Rotterdam - a city I knew I would enjoy after plenty of research. I also visited and explored Utrecht. There was no doubt in my mind that Rotterdam was my speed. Plus, considering how small the Netherlands is, I could easily travel anywhere in the country within a few hours by train. I decided Rotterdam was the perfect fit for me. My sister agreed.",
    "links": [
      {
        "text": "Rotterdam Netherlands Walking Tour",
        "url": "https://www.youtube.com/watch?v=rRm94fFdaDY"
      }
    ]
  },
  {
    "date": "November 2024",
    "title": "Savings Target in Euros",
    "type": "Logistics",
    "description": "From the outside looking in, I still live in the U.S. In my mind, the move has already begun. That means I would need to make decisions as though I was in the middle of moving, not as if the move was coming in the future. I set a savings target of €14,500, which is €4,500 for the DAFT visa business account reserve plus an additional €10,000 for securing an apartment paying any fees. I actually set this savings target in October during my visit to Rotterdam. Because I had already sold my car and downsized my living expenses significantly, I was able to save aggressively (pure strategy). I opened a Wise account to hold my Euros. I am already the type to track my finances meticulously using Excel. So, every time money came in, I already knew exactly how much of it to transfer, leaving the rest for my U.S. expenses.",
    "links": [
      {
        "text": "Holding Euros with Wise",
        "url": "https://wise.com/invite/dic/seand823"
      },
      {
          "text": "DAFT visa requirements (see the business account reserve)",
          "url": "https://dutchamericanfriendship.com/how-to-get-a-daft-visa/"
      }
    ]
  },
  {
    "date": "May 2025",
    "title": "Purchased One-Way Flight for September 2025",
    "type": "Logistics",
    "description": "On May 30, 2025, I booked my flight to the Netherlands for September 22, 2025, the day my U.S. apartment lease ends. I'll turn in my keys and head straight to the airport. 🎉 After arriving in the Netherlands on the 23rd, I'll stay in a hotel for the remainder of September. On October 1st, I'll check into a short-term rental in Rotterdam, secured through HousingAnywhere. These types of rentals allow address registration (inschrijven, meaning you can inform the local municipality that this is your address), which is necessary for the DAFT visa application. With a registered address, I can secure a BSN (Dutch social security number, can be done in one day) and open a business account with a local Dutch bank (can also be done in one day). I'll then register my business as a sole proprietorship (ZZP'er, a freelancer) with the Dutch Chamber of Commerce (Kamer van Koophandel). With a registered address, BSN, and €4,500 deposited into the business account, I can officially apply for the DAFT visa. Approval is nearly guaranteed. Once approved, I live in the Netherlands. That's it. Done.",
    "links": [
      {
        "text": "HousingAnywhere short-term rentals",
        "url": "https://housinganywhere.com/s/Rotterdam--Netherlands?endDate=2025-10-31&flexDays=14&registration=possible&startDate=2025-10-01"
      },
      {
        "text": "ZZP'er (Freelancer)",
        "url": "https://business.gov.nl/starting-your-business/starting-as-a-self-employed-professional/get-started-as-a-freelancer-or-zzper/"
      },
      {
        "text": "BSN (Dutch SSN)",
        "url": "https://www.government.nl/topics/personal-data/citizen-service-number-bsn"
      },
      {
        "text": "DAFT visa",
        "url": "https://www.cardon.nl/blog/the-dutch-daft-visa-for-american-immigrants-in-5-steps"
      }
    ]
  },
  {
    "date": "June 2025",
    "title": "Secured Short-Term Accommodation in Rotterdam",
    "type": "Logistics",
    "description": "With less than 90 days until my move, I performed another search for short-term housing, but this time with intent to book. As with many milestones in this journey, the universe aligned me with incredible information exactly when I needed it. I was introduce to an organization called The Social Hub, which is a collection of extended-stay hotels in Europe. They have a location in Rotterdam that offers short-term rentals with the ability to register your address (inschrijven). I booked an extended-stay studio through the end of 2025, which will allow me to register my address with the municipality and apply for the DAFT visa. It is designed specifically for those needing temporary housing that can be treated like a permanent home. If all goes well, my DAFT visa will be approved during my stay at The Social Hub, and I will be searching for a permanent apartment in Rotterdam during that period.",
    "links": [
      {
        "text": "The Social Hub",
        "url": "https://www.thesocialhub.co/"
      }
    ]
  },
  {
    "date": "September 2025",
    "title": "Boots on the Ground in Rotterdam",
    "type": "Milestone",
    "description": "While the plan isn't fully executed until I have an approved [DAFT] visa, I can't help but celebrate this major milestone. 🎉 As of September 23, 2025, me and all of my worldly possessions are in Rotterdam, Netherlands with no return flight to the U.S. booked or planned. I am in a temporary hotel for the first 8 days and will be moving to a less temporary, extended stay hotel (The Social Hub) on October 1st. From here, I will be applying for my BSN (Dutch social security number), opening a Dutch business bank account, registering my business with the Kamer van Koophandel (Dutch Chamber of Commerce), and applying for my DAFT visa. The extended stay hotel allows me to register a personal address which puts me on the path to meet all the requirements for the DAFT visa. The next few months will be busy, but I am excited to finally be here and start this new chapter of my life.",
    "links": [
      {
        "text": "The Social Hub - Rotterdam",
        "url": "https://www.thesocialhub.co/rotterdam/"
      },
      {
        "text": "DAFT visa",
        "url": "https://www.cardon.nl/blog/the-dutch-daft-visa-for-american-immigrants-in-5-steps"
      }
    ]
  }
]
